xml/request_templates/bog_bd1forsk_knausgaard.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="http://oss.dbc.dk/ns/openformat" xmlns:os="http://oss.dbc.dk/ns/opensearch" xmlns:ac="http://biblstandard.dk/ac/namespace/" xmlns:dc="http://purl.org/dc/elements/1.1/" xmlns:dcterms="http://purl.org/dc/terms/" xmlns:dkabm="http://biblstandard.dk/abm/namespace/dkabm/" xmlns:dkdcplus="http://biblstandard.dk/abm/namespace/dkdcplus/" xmlns:marcx="info:lc/xmlns/marcxchange-v1" xmlns:oss="http://oss.dbc.dk/ns/osstypes" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
  <SOAP-ENV:Body>
      <ns1:formatRequest>
        <ns1:originalData>
          <os:collection>
            <os:resultPosition>1</os:resultPosition>
            <os:numberOfObjects>1</os:numberOfObjects>
            <os:object>
              <dkabm:record>
                <ac:identifier>008182582-1|810015</ac:identifier>
                <dc:identifier xsi:type="dkdcplus:ISBN">9788711427286</dc:identifier>
                <ac:source>Bibliotekskatalog</ac:source>
                <dc:source>Min kamp</dc:source>
                <dc:title>Min kamp</dc:title>
                <dc:title xsi:type="dkdcplus:full">Min kamp : roman</dc:title>
                <dc:creator xsi:type="dkdcplus:aut">Karl Ove Knausgård</dc:creator>
                <dc:creator xsi:type="oss:sort">Knausgård, Karl Ove</dc:creator>
                <dc:subject xsi:type="dkdcplus:DK5-Text">Skønlitteratur</dc:subject>
                <dc:subject xsi:type="dkdcplus:genre">fiktion</dc:subject>
                <dc:subject xsi:type="dkdcplus:DK5">sk</dc:subject>
                <dcterms:audience>voksenmaterialer</dcterms:audience>
                <dkdcplus:version>3. oplag</dkdcplus:version>
                <dc:publisher>Lindhardt og Ringhof</dc:publisher>
                <dc:contributor xsi:type="dkdcplus:trl">Sara Koch</dc:contributor>
                <dc:date>2010</dc:date>
                <dc:type xsi:type="dkdcplus:BibDK-Type">Bog</dc:type>
                <dcterms:extent>487 sider</dcterms:extent>
                <dc:language xsi:type="dcterms:ISO639-2">dan</dc:language>
                <dc:language>Dansk</dc:language>
              </dkabm:record>
              <marcx:collection>
                <marcx:record format="danMARC2" type="Bibliographic">
                  <marcx:leader>000000000000000000000000</marcx:leader>
                  <marcx:datafield ind1="0" ind2="0" tag="001">
                    <marcx:subfield code="a">008182582-1</marcx:subfield>
                    <marcx:subfield code="b">810015</marcx:subfield>
                    <marcx:subfield code="f">a</marcx:subfield>
                  </marcx:datafield>
                  <marcx:datafield ind1="0" ind2="0" tag="002">
                    <marcx:subfield code="d">28329490</marcx:subfield>
                  </marcx:datafield>
                  <marcx:datafield ind1="0" ind2="0" tag="002">
                    <marcx:subfield code="d">x928329490</marcx:subfield>
                  </marcx:datafield>
                  <marcx:datafield ind1="0" ind2="0" tag="004">
                    <marcx:subfield code="r">n</marcx:subfield>
                    <marcx:subfield code="a">e</marcx:subfield>
                  </marcx:datafield>
                  <marcx:datafield ind1="0" ind2="0" tag="008">
                    <marcx:subfield code="t">m</marcx:subfield>
                    <marcx:subfield code="u">r</marcx:subfield>
                    <marcx:subfield code="a">2010</marcx:subfield>
                    <marcx:subfield code="z">2010</marcx:subfield>
                    <marcx:subfield code="b">dk</marcx:subfield>
                    <marcx:subfield code="d">x</marcx:subfield>
                    <marcx:subfield code="j">f</marcx:subfield>
                    <marcx:subfield code="l">dan</marcx:subfield>
                    <marcx:subfield code="v">0</marcx:subfield>
                  </marcx:datafield>
                  <marcx:datafield ind1="0" ind2="0" tag="009">
                    <marcx:subfield code="a">a</marcx:subfield>
                    <marcx:subfield code="g">xx</marcx:subfield>
                  </marcx:datafield>
                  <marcx:datafield ind1="0" ind2="0" tag="018">
                    <marcx:subfield code="a">008182582</marcx:subfield>
                  </marcx:datafield>
                  <marcx:datafield ind1="0" ind2="0" tag="021">
                    <marcx:subfield code="e">9788711427286</marcx:subfield>
                    <marcx:subfield code="c">ib.</marcx:subfield>
                  </marcx:datafield>
                  <marcx:datafield ind1="0" ind2="0" tag="041">
                    <marcx:subfield code="a">dan</marcx:subfield>
                    <marcx:subfield code="c">nor</marcx:subfield>
                  </marcx:datafield>
                  <marcx:datafield ind1="0" ind2="0" tag="080">
                    <marcx:subfield code="a">8</marcx:subfield>
                  </marcx:datafield>
                  <marcx:datafield ind1="0" ind2="0" tag="100">
                    <marcx:subfield code="a">Knausgård</marcx:subfield>
                    <marcx:subfield code="h">Karl Ove</marcx:subfield>
                    <marcx:subfield code="4">aut</marcx:subfield>
                  </marcx:datafield>
                  <marcx:datafield ind1="0" ind2="0" tag="241">
                    <marcx:subfield code="a">Min kamp</marcx:subfield>
                    <marcx:subfield code="r">norsk</marcx:subfield>
                  </marcx:datafield>
                  <marcx:datafield ind1="0" ind2="0" tag="245">
                    <marcx:subfield code="a">Min kamp</marcx:subfield>
                    <marcx:subfield code="g">1. [bog]</marcx:subfield>
                    <marcx:subfield code="c">roman</marcx:subfield>
                  </marcx:datafield>
                  <marcx:datafield ind1="0" ind2="0" tag="250">
                    <marcx:subfield code="x">3. oplag</marcx:subfield>
                  </marcx:datafield>
                  <marcx:datafield ind1="0" ind2="0" tag="260">
                    <marcx:subfield code="a">Kbh.</marcx:subfield>
                    <marcx:subfield code="b">Lindhardt og Ringhof</marcx:subfield>
                    <marcx:subfield code="c">2010</marcx:subfield>
                  </marcx:datafield>
                  <marcx:datafield ind1="0" ind2="0" tag="300">
                    <marcx:subfield code="a">487 sider</marcx:subfield>
                  </marcx:datafield>
                  <marcx:datafield ind1="0" ind2="0" tag="652">
                    <marcx:subfield code="n">85</marcx:subfield>
                    <marcx:subfield code="z">26</marcx:subfield>
                  </marcx:datafield>
                  <marcx:datafield ind1="0" ind2="0" tag="652">
                    <marcx:subfield code="o">sk</marcx:subfield>
                  </marcx:datafield>
                  <marcx:datafield ind1="0" ind2="0" tag="720">
                    <marcx:subfield code="o">Sara Koch</marcx:subfield>
                    <marcx:subfield code="4">trl</marcx:subfield>
                  </marcx:datafield>
                </marcx:record>
              </marcx:collection>
              <os:identifier>810015-katalog:008182582-1</os:identifier>
              <os:creationDate>2012-04-04</os:creationDate>
<os:holdingsCount>12</os:holdingsCount>
<os:lendingLibraries>12</os:lendingLibraries>
              <os:formatsAvailable>
                <os:format>dkabm</os:format>
                <os:format>marcxchange</os:format>
              </os:formatsAvailable>
            </os:object>
          </os:collection>
        </ns1:originalData>
       <ns1:outputFormat>PLACEHOLDER</ns1:outputFormat>
       <ns1:trackingId>bog_bd1forsk_knausgaard.xml.PLACEHOLDER</ns1:trackingId>
      </ns1:formatRequest>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
